# Version:1.0 MMMC View Definition File
# Do Not Remove Above Line
create_rc_corner -name HV_TYP -cap_table {H18/cds/HK_H18/LEF/h18a6/h18a6.capTable} -T {25} -preRoute_res {1.0} -preRoute_cap {1.0} -preRoute_clkres {0.0} -preRoute_clkcap {0.0} -postRoute_res {1.0} -postRoute_cap {1.0} -postRoute_xcap {1.0} -postRoute_clkres {0.0} -postRoute_clkcap {0.0}
create_op_cond -name HV_TYP -library_file {H18/liberty/h18_1.8V/h18_CORELIB_HV_TYP.lib} -P {10.0} -V {1.8} -T {25}
create_library_set -name HV_TYP -timing {H18/liberty/h18_1.8V/h18_CORELIB_HV_TYP.lib H18/liberty/h18_1.8V/h18_IOLIB_HV_TYP.lib H18/liberty/h18_1.8V/h18_PHYSICAL.lib}
create_constraint_mode -name HV_TYP -sdc_files {pads-mapped.sdc}
create_delay_corner -name HV_TYP -library_set {HV_TYP} -rc_corner {HV_TYP}
create_analysis_view -name HV_TYP -constraint_mode {HV_TYP} -delay_corner {HV_TYP}
set_analysis_view -setup {HV_TYP} -hold {HV_TYP}
