# ####################################################################

#  Created by Encounter(R) RTL Compiler v11.20-s017_1 on Thu Jan 29 22:04:22 +0000 2015

# ####################################################################

set sdc_version 1.7

set_units -capacitance 1000.0fF
set_units -time 1000.0ps

# Set the current design
current_design pat

create_clock -name "clk" -add -period 2.0 -waveform {0.0 1.0} [get_ports clk]
set_load -pin_load -max 0.01 [get_ports {pc[9]}]
set_load -pin_load -max 0.01 [get_ports {pc[8]}]
set_load -pin_load -max 0.01 [get_ports {pc[7]}]
set_load -pin_load -max 0.01 [get_ports {pc[6]}]
set_load -pin_load -max 0.01 [get_ports {pc[5]}]
set_load -pin_load -max 0.01 [get_ports {pc[4]}]
set_load -pin_load -max 0.01 [get_ports {pc[3]}]
set_load -pin_load -max 0.01 [get_ports {pc[2]}]
set_load -pin_load -max 0.01 [get_ports {pc[1]}]
set_load -pin_load -max 0.01 [get_ports {pc[0]}]
set_load -pin_load -max 0.01 [get_ports jump]
set_load -pin_load -max 0.01 [get_ports {bufp[2]}]
set_load -pin_load -max 0.01 [get_ports {bufp[1]}]
set_load -pin_load -max 0.01 [get_ports {bufp[0]}]
set_load -pin_load -max 0.01 [get_ports {fieldp[4]}]
set_load -pin_load -max 0.01 [get_ports {fieldp[3]}]
set_load -pin_load -max 0.01 [get_ports {fieldp[2]}]
set_load -pin_load -max 0.01 [get_ports {fieldp[1]}]
set_load -pin_load -max 0.01 [get_ports {fieldp[0]}]
set_load -pin_load -max 0.01 [get_ports {fieldwp[4]}]
set_load -pin_load -max 0.01 [get_ports {fieldwp[3]}]
set_load -pin_load -max 0.01 [get_ports {fieldwp[2]}]
set_load -pin_load -max 0.01 [get_ports {fieldwp[1]}]
set_load -pin_load -max 0.01 [get_ports {fieldwp[0]}]
set_load -pin_load -max 0.01 [get_ports field_write_en_low]
set_load -pin_load -max 0.01 [get_ports field_write_en_high]
set_load -pin_load -max 0.01 [get_ports {field_out[7]}]
set_load -pin_load -max 0.01 [get_ports {field_out[6]}]
set_load -pin_load -max 0.01 [get_ports {field_out[5]}]
set_load -pin_load -max 0.01 [get_ports {field_out[4]}]
set_load -pin_load -max 0.01 [get_ports {field_out[3]}]
set_load -pin_load -max 0.01 [get_ports {field_out[2]}]
set_load -pin_load -max 0.01 [get_ports {field_out[1]}]
set_load -pin_load -max 0.01 [get_ports {field_out[0]}]
set_load -pin_load -max 0.01 [get_ports {outputs[2][31]}]
set_load -pin_load -max 0.01 [get_ports {outputs[2][30]}]
set_load -pin_load -max 0.01 [get_ports {outputs[2][29]}]
set_load -pin_load -max 0.01 [get_ports {outputs[2][28]}]
set_load -pin_load -max 0.01 [get_ports {outputs[2][27]}]
set_load -pin_load -max 0.01 [get_ports {outputs[2][26]}]
set_load -pin_load -max 0.01 [get_ports {outputs[2][25]}]
set_load -pin_load -max 0.01 [get_ports {outputs[2][24]}]
set_load -pin_load -max 0.01 [get_ports {outputs[2][23]}]
set_load -pin_load -max 0.01 [get_ports {outputs[2][22]}]
set_load -pin_load -max 0.01 [get_ports {outputs[2][21]}]
set_load -pin_load -max 0.01 [get_ports {outputs[2][20]}]
set_load -pin_load -max 0.01 [get_ports {outputs[2][19]}]
set_load -pin_load -max 0.01 [get_ports {outputs[2][18]}]
set_load -pin_load -max 0.01 [get_ports {outputs[2][17]}]
set_load -pin_load -max 0.01 [get_ports {outputs[2][16]}]
set_load -pin_load -max 0.01 [get_ports {outputs[2][15]}]
set_load -pin_load -max 0.01 [get_ports {outputs[2][14]}]
set_load -pin_load -max 0.01 [get_ports {outputs[2][13]}]
set_load -pin_load -max 0.01 [get_ports {outputs[2][12]}]
set_load -pin_load -max 0.01 [get_ports {outputs[2][11]}]
set_load -pin_load -max 0.01 [get_ports {outputs[2][10]}]
set_load -pin_load -max 0.01 [get_ports {outputs[2][9]}]
set_load -pin_load -max 0.01 [get_ports {outputs[2][8]}]
set_load -pin_load -max 0.01 [get_ports {outputs[2][7]}]
set_load -pin_load -max 0.01 [get_ports {outputs[2][6]}]
set_load -pin_load -max 0.01 [get_ports {outputs[2][5]}]
set_load -pin_load -max 0.01 [get_ports {outputs[2][4]}]
set_load -pin_load -max 0.01 [get_ports {outputs[2][3]}]
set_load -pin_load -max 0.01 [get_ports {outputs[2][2]}]
set_load -pin_load -max 0.01 [get_ports {outputs[2][1]}]
set_load -pin_load -max 0.01 [get_ports {outputs[2][0]}]
set_load -pin_load -max 0.01 [get_ports {outputs[1][31]}]
set_load -pin_load -max 0.01 [get_ports {outputs[1][30]}]
set_load -pin_load -max 0.01 [get_ports {outputs[1][29]}]
set_load -pin_load -max 0.01 [get_ports {outputs[1][28]}]
set_load -pin_load -max 0.01 [get_ports {outputs[1][27]}]
set_load -pin_load -max 0.01 [get_ports {outputs[1][26]}]
set_load -pin_load -max 0.01 [get_ports {outputs[1][25]}]
set_load -pin_load -max 0.01 [get_ports {outputs[1][24]}]
set_load -pin_load -max 0.01 [get_ports {outputs[1][23]}]
set_load -pin_load -max 0.01 [get_ports {outputs[1][22]}]
set_load -pin_load -max 0.01 [get_ports {outputs[1][21]}]
set_load -pin_load -max 0.01 [get_ports {outputs[1][20]}]
set_load -pin_load -max 0.01 [get_ports {outputs[1][19]}]
set_load -pin_load -max 0.01 [get_ports {outputs[1][18]}]
set_load -pin_load -max 0.01 [get_ports {outputs[1][17]}]
set_load -pin_load -max 0.01 [get_ports {outputs[1][16]}]
set_load -pin_load -max 0.01 [get_ports {outputs[1][15]}]
set_load -pin_load -max 0.01 [get_ports {outputs[1][14]}]
set_load -pin_load -max 0.01 [get_ports {outputs[1][13]}]
set_load -pin_load -max 0.01 [get_ports {outputs[1][12]}]
set_load -pin_load -max 0.01 [get_ports {outputs[1][11]}]
set_load -pin_load -max 0.01 [get_ports {outputs[1][10]}]
set_load -pin_load -max 0.01 [get_ports {outputs[1][9]}]
set_load -pin_load -max 0.01 [get_ports {outputs[1][8]}]
set_load -pin_load -max 0.01 [get_ports {outputs[1][7]}]
set_load -pin_load -max 0.01 [get_ports {outputs[1][6]}]
set_load -pin_load -max 0.01 [get_ports {outputs[1][5]}]
set_load -pin_load -max 0.01 [get_ports {outputs[1][4]}]
set_load -pin_load -max 0.01 [get_ports {outputs[1][3]}]
set_load -pin_load -max 0.01 [get_ports {outputs[1][2]}]
set_load -pin_load -max 0.01 [get_ports {outputs[1][1]}]
set_load -pin_load -max 0.01 [get_ports {outputs[1][0]}]
set_load -pin_load -max 0.01 [get_ports {outputs[0][31]}]
set_load -pin_load -max 0.01 [get_ports {outputs[0][30]}]
set_load -pin_load -max 0.01 [get_ports {outputs[0][29]}]
set_load -pin_load -max 0.01 [get_ports {outputs[0][28]}]
set_load -pin_load -max 0.01 [get_ports {outputs[0][27]}]
set_load -pin_load -max 0.01 [get_ports {outputs[0][26]}]
set_load -pin_load -max 0.01 [get_ports {outputs[0][25]}]
set_load -pin_load -max 0.01 [get_ports {outputs[0][24]}]
set_load -pin_load -max 0.01 [get_ports {outputs[0][23]}]
set_load -pin_load -max 0.01 [get_ports {outputs[0][22]}]
set_load -pin_load -max 0.01 [get_ports {outputs[0][21]}]
set_load -pin_load -max 0.01 [get_ports {outputs[0][20]}]
set_load -pin_load -max 0.01 [get_ports {outputs[0][19]}]
set_load -pin_load -max 0.01 [get_ports {outputs[0][18]}]
set_load -pin_load -max 0.01 [get_ports {outputs[0][17]}]
set_load -pin_load -max 0.01 [get_ports {outputs[0][16]}]
set_load -pin_load -max 0.01 [get_ports {outputs[0][15]}]
set_load -pin_load -max 0.01 [get_ports {outputs[0][14]}]
set_load -pin_load -max 0.01 [get_ports {outputs[0][13]}]
set_load -pin_load -max 0.01 [get_ports {outputs[0][12]}]
set_load -pin_load -max 0.01 [get_ports {outputs[0][11]}]
set_load -pin_load -max 0.01 [get_ports {outputs[0][10]}]
set_load -pin_load -max 0.01 [get_ports {outputs[0][9]}]
set_load -pin_load -max 0.01 [get_ports {outputs[0][8]}]
set_load -pin_load -max 0.01 [get_ports {outputs[0][7]}]
set_load -pin_load -max 0.01 [get_ports {outputs[0][6]}]
set_load -pin_load -max 0.01 [get_ports {outputs[0][5]}]
set_load -pin_load -max 0.01 [get_ports {outputs[0][4]}]
set_load -pin_load -max 0.01 [get_ports {outputs[0][3]}]
set_load -pin_load -max 0.01 [get_ports {outputs[0][2]}]
set_load -pin_load -max 0.01 [get_ports {outputs[0][1]}]
set_load -pin_load -max 0.01 [get_ports {outputs[0][0]}]
set_clock_gating_check -setup 0.0 
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports clk]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports reset]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {instruction_in[22]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {instruction_in[21]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {instruction_in[20]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {instruction_in[19]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {instruction_in[18]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {instruction_in[17]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {instruction_in[16]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {instruction_in[15]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {instruction_in[14]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {instruction_in[13]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {instruction_in[12]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {instruction_in[11]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {instruction_in[10]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {instruction_in[9]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {instruction_in[8]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {instruction_in[7]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {instruction_in[6]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {instruction_in[5]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {instruction_in[4]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {instruction_in[3]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {instruction_in[2]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {instruction_in[1]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {instruction_in[0]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {field_in_low[7]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {field_in_low[6]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {field_in_low[5]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {field_in_low[4]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {field_in_low[3]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {field_in_low[2]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {field_in_low[1]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {field_in_low[0]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {field_in_high[7]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {field_in_high[6]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {field_in_high[5]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {field_in_high[4]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {field_in_high[3]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {field_in_high[2]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {field_in_high[1]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {field_in_high[0]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[2][31]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[2][30]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[2][29]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[2][28]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[2][27]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[2][26]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[2][25]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[2][24]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[2][23]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[2][22]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[2][21]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[2][20]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[2][19]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[2][18]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[2][17]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[2][16]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[2][15]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[2][14]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[2][13]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[2][12]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[2][11]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[2][10]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[2][9]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[2][8]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[2][7]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[2][6]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[2][5]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[2][4]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[2][3]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[2][2]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[2][1]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[2][0]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[1][31]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[1][30]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[1][29]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[1][28]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[1][27]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[1][26]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[1][25]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[1][24]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[1][23]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[1][22]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[1][21]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[1][20]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[1][19]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[1][18]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[1][17]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[1][16]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[1][15]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[1][14]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[1][13]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[1][12]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[1][11]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[1][10]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[1][9]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[1][8]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[1][7]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[1][6]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[1][5]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[1][4]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[1][3]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[1][2]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[1][1]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[1][0]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[0][31]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[0][30]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[0][29]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[0][28]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[0][27]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[0][26]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[0][25]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[0][24]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[0][23]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[0][22]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[0][21]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[0][20]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[0][19]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[0][18]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[0][17]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[0][16]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[0][15]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[0][14]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[0][13]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[0][12]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[0][11]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[0][10]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[0][9]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[0][8]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[0][7]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[0][6]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[0][5]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[0][4]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[0][3]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[0][2]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[0][1]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {inputs[0][0]}]
set_ideal_network [get_ports {inputs[0][0]}]
set_wire_load_mode "enclosed"
set_wire_load_selection_group "sub_micron" -library "h18_CORELIB_HV_TYP"
set_dont_use [get_lib_cells h18_CORELIB_HV_TYP/BUSHDX1_HV]
set_dont_use [get_lib_cells h18_CORELIB_HV_TYP/FILLCELLX1_HV]
set_dont_use [get_lib_cells h18_CORELIB_HV_TYP/FILLCELLX2_HV]
set_dont_use [get_lib_cells h18_CORELIB_HV_TYP/FILLCELLX4_HV]
set_dont_use [get_lib_cells h18_CORELIB_HV_TYP/FILLCELLX8_HV]
set_dont_use [get_lib_cells h18_CORELIB_HV_TYP/FILLCELLX16_HV]
set_dont_use [get_lib_cells h18_CORELIB_HV_TYP/FILLCELLX32_HV]
set_dont_use [get_lib_cells h18_CORELIB_HV_TYP/TIE0_HV]
set_dont_use [get_lib_cells h18_CORELIB_HV_TYP/TIE1_HV]
set_dont_use [get_lib_cells h18_IOLIB_HV_TYP/IOPAD5V_20_HV]
set_dont_use [get_lib_cells h18_IOLIB_HV_TYP/IOPAD5V_3_HV]
set_dont_use [get_lib_cells h18_IOLIB_HV_TYP/IOPAD5V_8_HV]
set_dont_use [get_lib_cells h18_IOLIB_HV_TYP/IOPAD1V8_20_HV]
set_dont_use [get_lib_cells h18_IOLIB_HV_TYP/IOPAD1V8_3_HV]
set_dont_use [get_lib_cells h18_IOLIB_HV_TYP/IOPAD1V8_8_HV]
